EasyCleaner/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("password_digest", "created_at", "updated_at") VALUES (?, ?, ?)  [["password_digest", "$2a$12$K.41OoyUNrrg3GD51zWd8.dnqIPh/zPlvgAG68ODX6C1kifVvrvR2"], ["created_at", "2019-07-01 01:31:56.523960"], ["updated_at", "2019-07-01 01:31:56.523960"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$cvzcLl8LS4GGwzHmZELI9OWjJJqhxYJo/jIEs4cgmY4eO8wAAOLLG"], ["updated_at", "2019-07-01 01:39:09.068178"], ["id", 2]]