EasyCleaners/app/controllers/profiles_controller.rb

  def create
    @profile = current_user.build_profile(profile_params)

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("user_id", "last_name", "first_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["last_name", "Kim"], ["first_name", "Jinwook"], ["created_at", "2019-07-16 03:11:01.506458"], ["updated_at", "2019-07-16 03:11:01.506458"]]

  def destroy
    @profile.destroy
---
DELETE FROM "profiles" WHERE "profiles"."id" = ?  [["id", 1]]